[
  {
    "title": "Harry Potter and the Philosopher's Stone",
    "author": "J. K. Rowling",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/6/6b/Harry_Potter_and_the_Philosopher%27s_Stone_Book_Cover.jpg/220px-Harry_Potter_and_the_Philosopher%27s_Stone_Book_Cover.jpg",
    "price": 15.99,
    "synopsis": "Harry Potter lives with his abusive aunt and uncle, Vernon and Petunia Dursley, and their bullying son, Dudley. On Harry's eleventh birthday, a half-giant named Rubeus Hagrid personally delivers an acceptance letter to Hogwarts School of Witchcraft and Wizardry, revealing that Harry's parents, James and Lily Potter, were wizards. When Harry was one year old, an evil and powerful dark wizard, Lord Voldemort, murdered his parents. Harry survived Voldemort's killing curse that rebounded and seemingly destroyed the Dark Lord, leaving a lightning bolt-shaped scar on his forehead. Unknown to Harry, this act made him famous in the wizarding world. ",
    "date": "1997-07-26",
    "pages": 223,
    "stock": 10,
    "editorial": "Bloomsbury",
    "genres": ["Fantasy"],
    "formats": ["Physicall"],
    "languages": ["English", "Spanish"]
  },
  {
    "title": "Harry Potter and the Chamber of Secrets",
    "author": "J. K. Rowling",
    "image": "https://images.cdn2.buscalibre.com/fit-in/360x360/ae/a8/aea83e9ae8acb708e378ea2c2a8ce2b8.jpg",
    "price": 20.99,
    "synopsis": "The plot follows Harry's second year at Hogwarts School of Witchcraft and Wizardry, during which a series of messages on the walls of the school's corridors warn that the Chamber of Secrets has been opened and that the heir of Slytherin would kill all pupils who do not come from all-magical families.",
    "date": "1998-07-02",
    "pages": 251,
    "stock": 23,
    "editorial": "Bloomsbury",
    "genres": ["Fantasy"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "Harry Potter and the Prisoner of Azkaban",
    "author": "J. K. Rowling",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a0/Harry_Potter_and_the_Prisoner_of_Azkaban.jpg/220px-Harry_Potter_and_the_Prisoner_of_Azkaban.jpg",
    "price": 13.5,
    "synopsis": "Harry Potter lives with his abusive aunt and uncle, Vernon and Petunia Dursley, and their bullying son, Dudley. On Harry's eleventh birthday, a half-giant named Rubeus Hagrid personally delivers an acceptance letter to Hogwarts School of Witchcraft and Wizardry, revealing that Harry's parents, James and Lily Potter, were wizards. When Harry was one year old, an evil and powerful dark wizard, Lord Voldemort, murdered his parents. Harry survived Voldemort's killing curse that rebounded and seemingly destroyed the Dark Lord, leaving a lightning bolt-shaped scar on his forehead. Unknown to Harry, this act made him famous in the wizarding world. ",
    "date": "1997-07-26",
    "pages": 317,
    "stock": 10,
    "editorial": "Bloomsbury",
    "genres": ["Fantasy"],
    "formats": ["Physicall"],
    "languages": ["English", "Spanish"]
  },
  {
    "title": "Harry Potter and the Goblet of Fire",
    "author": "J. K. Rowling",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/b/b6/Harry_Potter_and_the_Goblet_of_Fire_cover.png/220px-Harry_Potter_and_the_Goblet_of_Fire_cover.png",
    "price": 16.99,
    "synopsis": "Harry Potter lives with his abusive aunt and uncle, Vernon and Petunia Dursley, and their bullying son, Dudley. On Harry's eleventh birthday, a half-giant named Rubeus Hagrid personally delivers an acceptance letter to Hogwarts School of Witchcraft and Wizardry, revealing that Harry's parents, James and Lily Potter, were wizards. When Harry was one year old, an evil and powerful dark wizard, Lord Voldemort, murdered his parents. Harry survived Voldemort's killing curse that rebounded and seemingly destroyed the Dark Lord, leaving a lightning bolt-shaped scar on his forehead. Unknown to Harry, this act made him famous in the wizarding world. ",
    "date": "2000-07-08",
    "pages": 636,
    "stock": 27,
    "editorial": "Bloomsbury",
    "genres": ["Fantasy"],
    "formats": ["Physicall"],
    "languages": ["English", "Chinese"]
  },
  {
    "title": "Harry Potter and the Order of the Phoenix",
    "author": "J. K. Rowling",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/7/70/Harry_Potter_and_the_Order_of_the_Phoenix.jpg/220px-Harry_Potter_and_the_Order_of_the_Phoenix.jpg",
    "price": 33.99,
    "synopsis": "Harry Potter is spending another tedious summer with his dreadful Aunt Petunia and Uncle Vernon when a group of evil spirits called “dementors” stage an unexpected attack on Harry and his cousin Dudley. After using magic to defend himself, Harry is visited by a group of wizards and whisked off to number twelve, Grimmauld Place, London. Number twelve is the home of Harry’s godfather, Sirius Black, and the headquarters of the Order of the Phoenix. The Order is a group of wizards, led by Hogwarts headmaster Albus Dumbledore, dedicated to fighting evil Lord Voldemort and his followers. The Order is forced to operate in secrecy, outside of the jurisdiction of the Ministry of Magic, which is headed by the dense and corrupt Cornelius Fudge. Fudge refuses to believe that Lord Voldemort has returned. ",
    "date": "2003-07-21",
    "pages": 766,
    "stock": 77,
    "editorial": "Bloomsbury",
    "genres": ["Fantasy"],
    "formats": ["Physicall"],
    "languages": ["English", "Russian"]
  },
  {
    "title": "Harry Potter and the Half-Blood Prince",
    "author": "J. K. Rowling",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/b/b5/Harry_Potter_and_the_Half-Blood_Prince_cover.png/220px-Harry_Potter_and_the_Half-Blood_Prince_cover.png",
    "price": 20.99,
    "synopsis": "Harry Potter learns a lot about Lord Voldemort's past, and Harry Potter prepares for the final battle against his nemesis with the help of Headmaster Dumbledore. But in that time, Voldemort returns to power, and makes a plan to destroy Harry.",
    "date": "2005-07-16",
    "pages": 607,
    "stock": 41,
    "editorial": "Bloomsbury",
    "genres": ["Fantasy"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "Harry Potter and the Deathly Hallows",
    "author": "J. K. Rowling",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a9/Harry_Potter_and_the_Deathly_Hallows.jpg/220px-Harry_Potter_and_the_Deathly_Hallows.jpg",
    "price": 45.99,
    "synopsis": "The Deathly Hallows is about Harry Potter and his friends finding ways to destroy Voldemort. They learn that even good contains a bit of evil, and vise versa. Even though the trio faces many difficulties, they persevere. ",
    "date": "2007-07-21",
    "pages": 607,
    "stock": 41,
    "editorial": "Bloomsbury",
    "genres": ["Fantasy"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "The Count of Monte Cristo",
    "author": "Alexandre Dumas",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1611834134i/7126.jpg",
    "price": 38.5,
    "synopsis": "Thrown in prison for a crime he has not committed, Edmond Dantès is confined to the grim fortress of If. There he learns of a great hoard of treasure hidden on the Isle of Monte Cristo and he becomes determined not only to escape, but also to unearth the treasure and use it to plot the destruction of the three men responsible for his incarceration. Dumas’ epic tale of suffering and retribution, inspired by a real-life case of wrongful imprisonment, was a huge popular success when it was first serialized in the 1840s.",
    "date": "1844-01-01",
    "pages": 1276,
    "stock": 10,
    "editorial": "Penguin Classics",
    "genres": ["Historical Fiction"],
    "formats": ["Digital"],
    "languages": ["English"]
  },
  {
    "title": "One Hundred Years of Solitude",
    "author": "Gabriel García Márquez",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327881361i/320.jpg",
    "price": 25.5,
    "synopsis": "The brilliant, bestselling, landmark novel that tells the story of the Buendia family, and chronicles the irreconcilable conflict between the desire for solitude and the need for love—in rich, imaginative prose that has come to define an entire genre known as magical realism.",
    "date": "1967-01-01",
    "pages": 417,
    "stock": 10,
    "editorial": "Harper",
    "genres": ["Magical Realism"],
    "formats": ["Physicall"],
    "languages": ["Spanish"]
  },
  {
    "title": "Memoirs of a Geisha",
    "author": "Arthur Golden",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1409595968i/929.jpg",
    "price": 30.1,
    "synopsis": "A literary sensation and runaway bestseller, this brilliant novel presents with seamless authenticity and exquisite lyricism the true confessions of one of Japan's most celebrated geisha. In Memoirs of a Geisha, we enter a world where appearances are paramount; where a girl's virginity is auctioned to the highest bidder; where women are trained to beguile the most powerful men; and where love is scorned as illusion. It is a unique and triumphant work of fiction - at once romantic, erotic, suspenseful - and completely unforgettable.",
    "date": "1997-09-27",
    "pages": 503,
    "stock": 10,
    "editorial": "Vintage Books USA",
    "genres": ["Historical Fiction"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "Les Misérables",
    "author": "Victor Hugo",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1411852091i/24280.jpg",
    "price": 49.25,
    "synopsis": "Victor Hugo's tale of injustice, heroism and love follows the fortunes of Jean Valjean, an escaped convict determined to put his criminal past behind him. But his attempts to become a respected member of the community are constantly put under threat: by his own conscience, when, owing to a case of mistaken identity, another man is arrested in his place; and by the relentless investigations of the dogged Inspector Javert. It is not simply for himself that Valjean must stay free, however, for he has sworn to protect the baby daughter of Fantine, driven to prostitution by poverty.",
    "date": "1862-01-01",
    "pages": 1463,
    "stock": 10,
    "editorial": "Penguin",
    "genres": ["Historical Fiction"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "The Picture of Dorian Gray",
    "author": "Oscar Wilde",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1546103428i/5297.jpg",
    "price": 25.5,
    "synopsis": "Oscar Wilde's only novel is the dreamlike story of a young man who sells his soul for eternal youth and beauty. In this celebrated work Wilde forged a devastating portrait of the effects of evil and debauchery on a young aesthete in late-19th-century England. Combining elements of the Gothic horror novel and decadent French fiction, the book centers on a striking premise: As Dorian Gray sinks into a life of crime and gross sensuality, his body retains perfect youth and vigor while his recently painted portrait grows day by day into a hideous record of evil, which he must keep hidden from the world. For over a century, this mesmerizing tale of horror and suspense has enjoyed wide popularity. It ranks as one of Wilde's most important creations and among the classic achievements of its kind.",
    "date": "1890-01-01",
    "pages": 272,
    "stock": 10,
    "editorial": "Random House: Modern Library",
    "genres": ["Fiction"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1546071216i/5907.jpg",
    "price": 27.5,
    "synopsis": "In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort. Written for J.R.R. Tolkien's own children, The Hobbit met with instant critical acclaim when it was first published in 1937. Now recognized as a timeless classic, this introduction to the hobbit Bilbo Baggins, the wizard Gandalf, Gollum, and the spectacular world of Middle-earth recounts of the adventures of a reluctant hero, a powerful and dangerous ring, and the cruel dragon Smaug the Magnificent. The text in this 372-page paperback edition is based on that first published in Great Britain by Collins Modern Classics (1998), and includes a note on the text by Douglas A. Anderson (2001).",
    "date": "1937-01-01",
    "pages": 366,
    "stock": 10,
    "editorial": "Houghton Mifflin",
    "genres": ["Fantasy"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "Little Women",
    "author": "Louisa May Alcott",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1562690475i/1934.jpg",
    "price": 27.35,
    "synopsis": "Generations of readers young and old, male and female, have fallen in love with the March sisters of Louisa May Alcott’s most popular and enduring novel, Little Women. Here are talented tomboy and author-to-be Jo, tragically frail Beth, beautiful Meg, and romantic, spoiled Amy, united in their devotion to each other and their struggles to survive in New England during the Civil War.",
    "date": "1868-01-01",
    "pages": 449,
    "stock": 10,
    "editorial": "Signet Classics",
    "genres": ["Romance"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "Lord of the Flies",
    "author": "William Golding",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327869409i/7624.jpg",
    "price": 12.7,
    "synopsis": "At the dawn of the next world war, a plane crashes on an uncharted island, stranding a group of schoolboys. At first, with no adult supervision, their freedom is something to celebrate; this far from civilization the boys can do anything they want. Anything. They attempt to forge their own society, failing, however, in the face of terror, sin and evil. And as order collapses, as strange howls echo in the night, as terror begins its reign, the hope of adventure seems as far from reality as the hope of being rescued. Labeled a parable, an allegory, a myth, a morality tale, a parody, a political treatise, even a vision of the apocalypse, Lord of the Flies is perhaps our most memorable novel about “the end of innocence, the darkness of man's heart.”",
    "date": "1954-01-01",
    "pages": 182,
    "stock": 10,
    "editorial": "Penguin Books ",
    "genres": ["Dystopia"],
    "formats": ["Digital"],
    "languages": ["English"]
  },
  {
    "title": "The Book Thief",
    "author": "Markus Zusak",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1522157426i/19063.jpg",
    "price": 26,
    "synopsis": "It is 1939. Nazi Germany. The country is holding its breath. Death has never been busier, and will be busier still. By her brother's graveside, Liesel's life is changed when she picks up a single object, partially hidden in the snow. It is The Gravedigger's Handbook, left behind there by accident, and it is her first act of book thievery. So begins a love affair with books and words, as Liesel, with the help of her accordian-playing foster father, learns to read. Soon she is stealing books from Nazi book-burnings, the mayor's wife's library, wherever there are books to be found. But these are dangerous times. When Liesel's foster family hides a Jew in their basement, Liesel's world is both opened up, and closed down.",
    "date": "2005-01-01",
    "pages": 552,
    "stock": 10,
    "editorial": "Alfred A. Knopf",
    "genres": ["Historical Fiction"],
    "formats": ["Digital"],
    "languages": ["English"]
  },
  {
    "title": "The Diary of a Young Girl",
    "author": "Anne Frank",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1560816565i/48855.jpg",
    "price": 19.75,
    "synopsis": "Discovered in the attic in which she spent the last years of her life, Anne Frank’s remarkable diary has become a world classic—a powerful reminder of the horrors of war and an eloquent testament to the human spirit. In 1942, with the Nazis occupying Holland, a thirteen-year-old Jewish girl and her family fled their home in Amsterdam and went into hiding. For the next two years, until their whereabouts were betrayed to the Gestapo, the Franks and another family lived cloistered in the “Secret Annexe” of an old office building. Cut off from the outside world, they faced hunger, boredom, the constant cruelties of living in confined quarters, and the ever-present threat of discovery and death. In her diary Anne Frank recorded vivid impressions of her experiences during this period. By turns thoughtful, moving, and surprisingly humorous, her account offers a fascinating commentary on human courage and frailty and a compelling self-portrait of a sensitive and spirited young woman whose promise was tragically cut short.",
    "date": "1947-01-01",
    "pages": 283,
    "stock": 10,
    "editorial": "Bantam",
    "genres": ["Biography"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "The Maid",
    "author": "Nita Prose",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1643228739i/55196813.jpg",
    "price": 28.9,
    "synopsis": "Molly Gray is not like everyone else. She struggles with social skills and misreads the intentions of others. Her gran used to interpret the world for her, codifying it into simple rules that Molly could live by. Since Gran died a few months ago, twenty-five-year-old Molly has been navigating life's complexities all by herself. No matter—she throws herself with gusto into her work as a hotel maid. Her unique character, along with her obsessive love of cleaning and proper etiquette, make her an ideal fit for the job. She delights in donning her crisp uniform each morning, stocking her cart with miniature soaps and bottles, and returning guest rooms at the Regency Grand Hotel to a state of perfection.",
    "date": "2022-01-04",
    "pages": 304,
    "stock": 10,
    "editorial": "HarperCollins",
    "genres": ["Thriller"],
    "formats": ["AudioBook"],
    "languages": ["English"]
  },
  {
    "title": "Crime and Punishment",
    "author": "Fyodor Dostoevsky",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1382846449i/7144.jpg",
    "price": 31.25,
    "synopsis": "Raskolnikov, a destitute and desperate former student, wanders through the slums of St Petersburg and commits a random murder without remorse or regret. He imagines himself to be a great man, a Napoleon: acting for a higher purpose beyond conventional moral law. But as he embarks on a dangerous game of cat and mouse with a suspicious police investigator, Raskolnikov is pursued by the growing voice of his conscience and finds the noose of his own guilt tightening around his neck. Only Sonya, a downtrodden sex worker, can offer the chance of redemption.",
    "date": "1866-01-01",
    "pages": 671,
    "stock": 10,
    "editorial": "Penguin",
    "genres": ["Crime"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1654371463i/18144590.jpg",
    "price": 17.3,
    "synopsis": "Combining magic, mysticism, wisdom, and wonder into an inspiring tale of self-discovery, The Alchemist has become a modern classic, selling millions of copies around the world and transforming the lives of countless readers across generations. Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, following our dreams.",
    "date": "1988-01-01",
    "pages": 182,
    "stock": 10,
    "editorial": "HarperOne",
    "genres": ["Fiction"],
    "formats": ["Physicall"],
    "languages": ["Spanish"]
  },
  {
    "title": "And Then There Were None",
    "author": "Agatha Christie",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1638425885i/16299.jpg",
    "price": 20.2,
    "synopsis": "First, there were ten—a curious assortment of strangers summoned as weekend guests to a little private island off the coast of Devon. Their host, an eccentric millionaire unknown to all of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal—and a secret that will seal their fate. For each has been marked for murder. A famous nursery rhyme is framed and hung in every room of the mansion",
    "date": "1939-01-01",
    "pages": 264,
    "stock": 10,
    "editorial": "St. Martin's Griffin",
    "genres": ["Mystery"],
    "formats": ["Physicall"],
    "languages": ["English"]
  },
  {
    "title": "Wuthering Heights",
    "author": "Emily Bronte",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1388212715i/6185.jpg",
    "price": 29.8,
    "synopsis": "At the centre of this novel is the passionate love between Catherine Earnshaw and Heathcliff - recounted with such emotional intensity that a plain tale of the Yorkshire moors acquires the depth and simplicity of ancient tragedy.",
    "date": "1847-01-01",
    "pages": 464,
    "stock": 10,
    "editorial": "Paperback",
    "genres": ["Romance"],
    "formats": ["Physicall"],
    "languages": ["English"]
  }
]
